app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
SELECT  "dogs".* FROM "dogs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    dogs_per_page = 5
    @dogs = Dog.all
    @page = params.fetch(:page, 0).to_i
    @dogs = Dog.offset(@page * dogs_per_page).limit(dogs_per_page)

INSERT INTO "dogs" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Speck"], ["description", "Just a dog"], ["created_at", "2021-10-08 02:53:57.664460"], ["updated_at", "2021-10-08 02:53:57.664460"]]
---
  def create
    @dog = Dog.new(dog_params)

    respond_to do |format|
      if @dog.save

UPDATE "dogs" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["name", "Speck"], ["description", ""], ["updated_at", "2021-10-08 02:53:58.001645"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @dog.update(dog_params)

DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 1]]
---
  def destroy
    @dog.destroy

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "dog_id", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-10-09 02:08:39.848682"], ["updated_at", "2021-10-09 02:08:39.848682"], ["dog_id", 1], ["user_id", 1]]
---
  def like
    @dog = Dog.all.find(params[:id])
    Like.create(user_id: current_user.id)

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_dog
    @dog = Dog.find(params[:id])