app/models/dog.rb

SELECT "likes".* FROM "likes" WHERE "likes"."dog_id" = ?  [["dog_id", 1]]
---
  def liked?(user)
    !!self.likes.find{|like| like.user_id == user.id}